<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Teo</title>
<link rel="stylesheet" type="text/css" href="doc.css">
</head>
<body>
<table width="100%"><tr><td>

<p>[<a href="indexfr.htm">Page d'accueil</a>][<a href="licencen.htm">Page in English</a>]</p>

<h3>Licence</h3>

<p>Ce document d&eacute;crit le copyright et les conditions de distribution des fichiers nomm&eacute;s ci-apr&egrave;s:</p>

<h5>teo, teo.exe et teow.exe sont Copyright &copy; 1997-2012 Gilles F&eacute;tis, &Eacute;ric Botcazou, Alexandre Pukall, J&eacute;r&eacute;mie Guillaume, Fran&ccedil;ois Mouret, Samuel Devulder.</h5>

<p>Ils peuvent &ecirc;tre librement redistribu&eacute;s &agrave; la condition EXPRESSE que le code source soit &eacute;galement inclus sur le support de distribution ou que toutes les informations n&eacute;cessaires &agrave; l'obtention de ce code source soient fournies sur le support de distribution.</p>

<p>Certaines portions sont Copyright &copy; DJ Delorie; elles sont disponibles s&eacute;par&eacute;ment, &agrave; la fois comme code source et fichier binaire, sur le site Web <a href="http://www.delorie.com">http://www.delorie.com</a>.</p>

<h5>cwsdpmi.exe est Copyright &copy; 1995-1997 Charles W Sandmann</h5>

<p>Il est disponible s&eacute;par&eacute;ment, &agrave; la fois comme code source et fichier binaire, sur le site Web <a href="http://www.delorie.com">http://www.delorie.com</a>.</p>

<p>Il peut &ecirc;tre redistribu&eacute; &agrave; la condition EXPRESSE que le code source soit &eacute;galement inclus sur le support de distribution ou que toutes les informations n&eacute;cessaires &agrave; l'obtention de ce code source soient fournies sur le support de distribution.</p>

<h5>language.dat et keyboard.dat sont des fichiers librement redistribuables de la librairie Allegro.</h5>

<p>La libraire Allegro est disponible s&eacute;par&eacute;ment, &agrave; la fois comme code source et fichier binaire, sur le site Web <a href="http://www.talula.demon.co.uk">http://www.talula.demon.co.uk</a>.</p>

<h5>libpng est Copyright &copy; Glenn Randers-Pehrson & Co</h5>

<p>Il est disponible en package binaire sur le site <a href="http://gnuwin32.sourceforge.net/">http://gnuwin32.sourceforge.net/</a> et comme source sur le site <a href="http://sourceforge.net/projects/libpng/">http://sourceforge.net/projects/libpng/</a>.</p>

<h5>zlib est Copyright &copy; Jean-loup Gailly and Mark Adler</h5>

<p>Il est disponible en package binaire sur le site <a href="http://gnuwin32.sourceforge.net/">http://gnuwin32.sourceforge.net/</a> et comme source sur le site <a href="http://www.zlib.net/">http://www.zlib.net/</a>.</p>

<hr>
<center><p>Teo developers &copy; 1997-2012 on <a href="https://sourceforge.net/projects/teoemulator/">SourceForge</a></p></center>
</td></tr></table>
</body>
</html>
