<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-1.8.1-1">
<TITLE>Teo - Manuel d'utilisation</TITLE>
<link REL="stylesheet" TYPE="text/css" HREF="doc.css">

</HEAD>
<BODY>
<TABLE WIDTH="100%"><TR><TD  CLASS="ttitre">
<IMG SRC="images/logo.jpg" WIDTH="324" HEIGHT="64" ALT="logo Teo">
</TD></TR></TABLE>

<CENTER>
L'&eacute;mulateur Thomson TO8<BR>
version 1.8.1 (Linux/X11)<BR>
Copyright &copy; 1997-2012 Gilles F&eacute;tis, Eric Botcazou, Alexandre Pukall, Fran&ccedil;ois Mouret, Samuel Devulder<BR><BR>
</CENTER>

<TABLE WIDTH="100%"><TR><TD CLASS="ttexte">
<A HREF="#Introduction">1. Introduction</A><BR>
<A HREF="#Installation">2. Installation</A><BR>
<A HREF="#Lancement">3. Lancement</A><BR>
<A HREF="#Modes_graphiques">4. Modes graphiques</A><BR>
<A HREF="#Clavier">5. Clavier</A><BR>
<A HREF="#Manettes">6. Manettes</A><BR>
<A HREF="#Souris">7. Souris</A><BR>
<A HREF="#Crayon_optique">8. Crayon optique</A><BR>
<A HREF="#Generateur_sonore">9. G&eacute;n&eacute;rateur sonore</A><BR>
<A HREF="#Supports_amovibles">10. Supports amovibles de lecture/&eacute;criture</A><BR>
<A HREF="#Panneau_de_controle">11. Panneau de contr&ocirc;le</A><BR>
<A HREF="#Acces_direct">12. Acc&egrave;s direct aux disquettes</A><BR>
<A HREF="#Commandes_diverses">13. Commandes diverses</A><BR>
<A HREF="#Desinstallation">14. D&eacute;sinstallation</A><BR>
<A HREF="#Limitations_et_bugs">15. Limitations et bugs</A><BR>
<A HREF="#Remerciements">16. Remerciements</A><BR>
<BR>

<H2><A NAME="Introduction"></A>1. Introduction</H2>
<P>Teo est un &eacute;mulateur TO8 pour PC, c'est-&agrave;-dire qu'il reproduit <EM>aussi fid&egrave;lement que possible</EM> sur PC le fonctionnement d'un autre micro-ordinateur: le Thomson TO8.</P>
<P>Teo ne r&eacute;alise lui-m&ecirc;me que l'&eacute;mulation <EM>mat&eacute;rielle</EM> du TO8, &agrave; savoir celle du microprocesseur Motorola MC6809E, de la carte m&eacute;moire, de la carte vid&eacute;o et des p&eacute;riph&eacute;riques suivants: souris, crayon optique, manettes de jeux, lecteur de cassettes et lecteurs de disquettes.</P>

<H2><A NAME="Installation"></A>2. Installation</H2>
<P>La configuration n&eacute;cessaire pour faire tourner l'&eacute;mulateur est la configuration standard des distributions r&eacute;centes; seule la pr&eacute;sence obligatoire de la version 2.12 ou sup&eacute;rieure du toolkit GTK+ peut n&eacute;cessiter une mise &agrave; jour du syst&egrave;me (RedHat 5.x, SuSE 5.x), disponible <A HREF="http://www.gtk.org">ici</A>.</P>

<P>Vous pouvez installer l'&eacute;mulateur de deux fa&ccedil;ons:</P>
<UL>
<LI>Ex&eacute;cutez <KBD>teo-1.8.1-i586.deb</KBD>. Le lancement de <KBD>Teo</KBD> se fera par le menu <KBD>Application/Jeux/Emulateur Teo</KBD>.
<LI>D&eacute;sarchivez <KBD>teo-1.8.1-i586.tar.gz</KBD> dans un m&ecirc;me r&eacute;pertoire. Le programme &eacute;x&eacute;cutable se nomme <KBD>teo</KBD>.</LI>
</UL>

<H2><A NAME="Lancement"></A>3. Lancement</H2>
<P>Le lancement du programme &eacute;x&eacute;cutable provoque l'affichage de l'ent&ecirc;te et des messages d'initialisation, puis le d&eacute;marrage de l'&eacute;mulation.</P>
<P>Teo accepte les param&egrave;tres suivants sur la ligne de commande:</P>
<TABLE BORDER="0" SUMMARY="options">
<TR><TD><KBD>[-help]</KBD></TD><TD>affiche l'aide en ligne</TD></TR>
<TR><TD><KBD>[-m file.m7]</KBD></TD><TD>place la cartouche file.m7 dans le lecteur</TD></TR>
<TR><TD><KBD>[-fast]</KBD></TD><TD>active la vitesse rapide de l'&eacute;mulateur</TD></TR>
<TR><TD><KBD>[-nosound]</KBD></TD><TD>supprime le son de l'&eacute;mulateur</TD></TR>
<TR><TD><KBD>[-geometry +x+y]</KBD></TD><TD>sp&eacute;cifie la position de la fen&ecirc;tre</TD></TR>
<TR><TD><KBD>[-noshm]</KBD></TD><TD>d&eacute;sactive l'utilisation de l'extension MIT-SHM</TD></TR>
<TR><TD><KBD>[-display displayname]</KBD></TD><TD>sp&eacute;cifie le nom du serveur X &agrave; utiliser</TD></TR>
<TR><TD><KBD>[-interlaced]</KBD></TD><TD>active le mode d'affichage entrelac&eacute;</TD></TR>
<TR><TD><KBD>[xxxxx]</KBD></TD><TD>charge un (des) fichier(s) SAP, K7, M7</TD></TR>
</TABLE>

<P>L'installation par les paquets <KBD>.deb</KBD> lance Teo avec l'option <KBD>-loadstate</KBD> par d&eacute;faut. Pour d&eacute;sactiver cette option ou en ajouter d'autres, choisir <KBD>Syst&egrave;me/Pr&eacute;f&eacute;rences/Menu principal</KBD>, s&eacute;lectionner alors <KBD>Jeux/Emulateur Teo</KBD>, cliquer sur <KBD>Propri&eacute;t&eacute;s</KBD> et changer les options par d&eacute;faut de l'ex&eacute;cutable.</P>

<H2><A NAME="Modes_graphiques"></A>4. Modes graphiques</H2>
<P>Teo peut fonctionner dans les quatres modes graphiques X11 les plus courants sur PC, &agrave; savoir 8,16,24 et 32 bits. N&eacute;anmoins, en mode 8 bits, les changements dynamiques de palette de couleurs ne sont pas &eacute;mul&eacute;s.</P>
<P>Il se lance dans une fen&ecirc;tre 640x400 (sans compter le pourtour de l'&eacute;cran), ce qui lui permet d'afficher tous les modes graphiques du TO8.</P>

<H2><A NAME="Clavier"></A>5. Clavier</H2>
<P>Le clavier du TO8 est &eacute;mul&eacute; dans sa totalit&eacute;, y compris les combinaisons de touches &agrave; base de CNT et de ACC.</P>
<P>L'&eacute;mulation est fid&egrave;le au clavier du PC (AZERTY), c'est &agrave; dire que le caract&egrave;re affich&eacute; sur l'&eacute;cran est celui inscrit sur la touche PC frapp&eacute;e, pourvu qu'il existe sur le clavier du TO8. Les deux SHIFT et ALTGR jouent leur r&ocirc;le naturel. Si la touche ALTGR reste sans effet, v&eacute;rifez vos r&eacute;glages pour l'agencement du clavier en ce qui concerne les touches de 3&egrave;me niveau: <KBD>Syst&egrave;me/Pr&eacute;f&eacute;rences/Clavier/Agencement/Options de l'agencement.../Touche s&eacute;lectionnant le 3&egrave;me niveau</KBD>.</P>
<P>La touche STOP est mapp&eacute;e sur le TAB du PC, CNT est mapp&eacute;e sur le CTRL gauche du PC, CAPSLOCK sur CAPSLOCK (le voyant CAPSLOCK est &eacute;mul&eacute;), ACC sur le ALT, HOME sur HOME, les 4 fl&egrave;ches sur les 4 fl&egrave;ches, INS sur INSER, EFF sur SUPPR. A noter que le DEL (=SHIFT+EFF) est mapp&eacute; directement sur BACKSPACE.</P>
<P>Les dix touches de fonctions sont mapp&eacute;es sur F1-F10 (on peut aussi obtenir, par exemple, F6 par Shift+F1).</P>
<P>La touche VERR. NUM. (NUMLOCK) permet d'activer le mode d'&eacute;mulation des manettes par le clavier (voyant NUMLOCK &eacute;teint) d&eacute;taill&eacute; dans la section suivante.</P>

<H2><A NAME="Manettes"></A>6. Manettes</H2>
<P>Lorsque le mode manettes est activ&eacute; (voyant NUMLOCK &eacute;teint), la pav&eacute; num&eacute;rique PC n'est plus mapp&eacute; sur la pav&eacute; num&eacute;rique du TO8, mais &eacute;mule les huit directions de la manette 0. Le bouton Fire est mapp&eacute; sur le CTRL droite.</P>
<P>Dans le m&ecirc;me temps, le bloc gauche clavier (A-E, Q-D, W-C) &eacute;mule la manette 1, tout en continuant &agrave; renvoyer les lettres au TO8 (de cette fa&ccedil;on, il est possible d'utiliser la manette 0 et le clavier complet du TO8). Le bouton Fire est mapp&eacute; sur le CTRL gauche.</P>
<P>Comme sur une manette r&eacute;elle, seule une direction est prise en compte et c'est celle de la derni&egrave;re touche appuy&eacute;e.</P>

<H2><A NAME="Souris"></A>7. Souris</H2>
<P>Sur le TO8 r&eacute;el, la souris est branch&eacute;e sur le port de la manette 0 donc les deux p&eacute;riph&eacute;riques ne peuvent &ecirc;tre utilis&eacute;s simultan&eacute;ment.</P>
<P>Sur le TO8 virtuel, au contraire, les deux fonctionnent en m&ecirc;me temps et la souris est le p&eacute;riph&eacute;rique de pointage par d&eacute;faut au d&eacute;marrage.</P>
<P>Elle a deux boutons mapp&eacute;s sur les boutons gauche et droite de la souris PC.</P>

<H2><A NAME="Crayon_optique"></A>8. Crayon optique</H2>
<P>Pourquoi &eacute;muler sp&eacute;cifiquement le crayon optique alors que la souris joue exactement le m&ecirc;me r&ocirc;le, y compris sous Basic 1.0 ? Il y a deux raisons:</P>
<UL>
<LI>le crayon optique, dans la mythologie thomsoniste, est une ic&ocirc;ne intouchable, &eacute;rig&eacute;e en symbole posthume par les nostalgiques de l'&egrave;re des TO7, TO8 et autres divinit&eacute;s informatiques nationales.</LI>
<LI>plus prosa&iuml;quement, contrairement aux programmes &eacute;crits pour le TO8 et la souris, ceux &eacute;crits pour le TO7, TO7-70 et le crayon optique n'affichent en g&eacute;n&eacute;ral pas de curseur indiquant la position du crayon sur l'&eacute;cran puisque celui-ci est sens&eacute; &ecirc;tre dans la main de l'utilisateur. Avec comme cons&eacute;quence d'&ecirc;tre impossibles &agrave; utiliser sur le TO8 virtuel avec la souris.</LI>
</UL>
<P>Le crayon optique peut donc &ecirc;tre s&eacute;lectionn&eacute; dans le menu R&eacute;glage et Pr&eacute;f&eacute;rences du TO8. Il est encore &eacute;mul&eacute; par la souris PC, son bouton &eacute;tant mapp&eacute; sur le bouton gauche de la souris. Le bouton droit permet alors de faire appara&icirc;tre/dispara&icirc;tre un curseur de rep&eacute;rage.</P>

<H2><A NAME="Generateur_sonore"></A>9. G&eacute;n&eacute;rateur sonore</H2>
<P>Le son du TO8 est &eacute;mul&eacute; via la carte son du PC. Les deux g&eacute;n&eacute;rateurs sonores 1-bit compatible TO7 et 6-bit compatible interface Musique et Jeux sont &eacute;mul&eacute;s.</P>
<P>Teo utilise le p&eacute;riph&eacute;rique sonore par d&eacute;faut du syst&egrave;me (via ALSA).</P>

<H2><A NAME="Supports_amovibles"></A>10. Supports amovibles de lecture/&eacute;criture</H2>
<P>Teo peut manipuler trois types de support amovible de lecture et/ou &eacute;criture: les cartouches ROM, les cassettes analogiques et les disquettes 3"5 Thomson. Chaque support est virtualis&eacute; par le biais de fichiers au format M&eacute;mo7 (extension .m7), K7 (extension .k7) et SAP (extension .sap) respectivement.</P>
<P>Voir le <A HREF="#Panneau_de_controle">panneau de contr&ocirc;le</A> pour le mode d'emploi relatif &agrave; leur manipulation avec l'&eacute;mulateur.</P>

<H2><A NAME="Panneau_de_controle"></A>11. Panneau de contr&ocirc;le</H2>
<P>L'appui sur la touche [ESC] du clavier du PC suspend l'&eacute;mulation et ouvre le Panneau de contr&ocirc;le.</P>

<CENTER><IMG SRC="images/teo_x1fr.png" WIDTH="338" HEIGHT="449" ALT="Panneau de contr&ocirc;le"></CENTER>

<P>Ce menu permet de communiquer avec l'&eacute;mulateur et d'acc&eacute;der aux p&eacute;riph&eacute;riques du TO8 (lecteur de cartouches, lecteur de cassettes et lecteurs de disquettes).</P>

<P>Les deux premiers boutons sont &agrave; utiliser avec pr&eacute;caution:</P>
<UL>
<LI>R&eacute;initialiser le TO8: il correspond &agrave; l'appui sur le bouton Reset du TO8 (situ&eacute; &agrave; droite sur le c&ocirc;t&eacute;). Comme sur le v&eacute;ritable TO8, il n'est pas toujours suffisant pour sortir d'un plantage.</LI>
<LI>Red&eacute;marrer &agrave; froid le TO8: plus violent, il correspond &agrave; &eacute;teindre puis rallumer le TO8. A priori rien ne lui r&eacute;siste, mais toutes les donn&eacute;es en m&eacute;moire vive sont alors perdues.</LI>
</UL>

<BLOCKQUOTE>

<H3>R&eacute;glages</H3>

<CENTER><IMG SRC="images/teo_x2fr.png" WIDTH="338" HEIGHT="217" ALT="R&eacute;glages"></CENTER>

<P>L'option vitesse permet de r&eacute;gler la vitesse de l'&eacute;mulation:</P>
<UL>
<LI>Vitesse exacte: &eacute;mulation du MC6809E &agrave; 1Mhz strictement, c'est le choix normal, le seul utilisable pour les jeux et pour l'&eacute;mulation sonore.</LI>
<LI>Vitesse rapide: &eacute;mulation du MC6809E &agrave; vitesse rapide. C'est utilisable pour les utilitaires, c'est m&ecirc;me assez agr&eacute;able d'avoir un TO8 rapide, mais le son est alors d&eacute;sactiv&eacute;.</LI>
</UL>
<P>Le mode vid&eacute;o entrelac&eacute; simule les &eacute;crans cathodiques en affichant uniquement la moitit&eacute; des lignes &agrave; chaque trame (lignes paires puis impaires), r&eacute;duisant ainsi le scintillement lors des changements rapides d'images (voir par exemple les d&eacute;mos TruC de PULS).</P>

<H3>Lecteurs de disquettes</H3>
<CENTER><IMG SRC="images/teo_x5fr.png" WIDTH="338" HEIGHT="222" ALT="Lecteurs de disquettes"></CENTER>
<P>Ce menu permet de s&eacute;lectionner les fichiers au format SAP (extension .sap) qui seront utilis&eacute;s comme disquettes en lecture/&eacute;criture par l'&eacute;mulateur. Ces fichiers sont des images des disquettes physiques Thomson, r&eacute;alis&eacute;es par un utilitaire sp&eacute;cifiques appel&eacute; SAP, et doivent &ecirc;tre stock&eacute;s sur le disque dur du PC, de pr&eacute;f&eacute;rence dans un sous-r&eacute;pertoire <KBD>disks</KBD> du r&eacute;pertoire de l'&eacute;mulateur.</P>
<P>Les lecteurs 0: et 1: correspondent aux deux faces du premier lecteur physique de disquettes d'un v&eacute;ritable TO8; les lecteurs 2: et 3: correspondent quant &agrave; eux aux deux faces du second lecteur.</P>
<P>Il est possible d'activer pour chacun des lecteurs, ind&eacute;pendamment des autres, la protection d'acc&egrave;s en &eacute;criture de la disquette (case "prot.").</P>
<P>S&eacute;lectionnez l'entr&eacute;e "(Acc&egrave;s direct)" de la bo&icirc;te combin&eacute;e si vous voulez <A HREF="#Acces_direct">acc&eacute;der directement</A> &agrave; une disquette physique 3"5 - 720 ko au format TO8 introduite dans le lecteur A: du PC. Il suffira ensuite d'ouvrir ou de s&eacute;lectionner un fichier SAP ou "(Aucun)" pour sortir du mode acc&egrave;s direct.</P>
<P>A noter qu'une led verte s'allume en haut &agrave; droite de l'&eacute;cran lorsqu'un acc&egrave;s disque est en cours.</P>

<H3>Lecteur de cassettes</H3>
<CENTER><IMG SRC="images/teo_x4fr.png" WIDTH="338" HEIGHT="221" ALT="Lecteur de cassettes"></CENTER>
<P>Vous pouvez ici non seulement s&eacute;lectionner le fichier au format K7 (extension .k7) qui joue le r&ocirc;le de cassette (bouton d'ouverture) mais aussi choisir de prot&eacute;ger son acc&egrave;s en &eacute;criture (case "prot.") ou encore modifier la position de la bande (champ num&eacute;rique "Compteur" et boutons "+" et "-") ou m&ecirc;me rembobiner la cassette, i.e revenir au d&eacute;but du fichier (bouton "Rembobiner la cassette"). Attention, tout changement de protection d'acc&egrave;s en &eacute;criture provoque automatiquement le rembobinage.</P>
<P>L&agrave; encore, il est conseill&eacute; de mettre tous les fichiers K7 dans un m&ecirc;me sous-r&eacute;pertoire <KBD>k7</KBD> du r&eacute;pertoire de l'&eacute;mulateur pour une s&eacute;lection plus ais&eacute;e.</P>

<H3>Lecteur de cartouches</H3>
<CENTER><IMG SRC="images/teo_x3fr.png" WIDTH="338" HEIGHT="221" ALT="Lecteur de cartouches"></CENTER>
<P>Ce menu permet de s&eacute;lectionner un fichier au format M&eacute;mo7 (extension .m7) et de le charger comme cartouche (bouton d'ouverture). L'intitul&eacute; de la cartouche appara&icirc;t dans la bo&icirc;te combin&eacute;e. A noter que Teo effectue alors un red&eacute;marrage &agrave; froid afin que la cartouche soit effectivement prise en compte et apparaisse sur l'&eacute;cran de d&eacute;marrage.</P>
<P>Il est conseill&eacute; de mettre tous les fichiers M&eacute;mo7 dans un m&ecirc;me sous-r&eacute;pertoire <KBD>memo7</KBD> du r&eacute;pertoire de l'&eacute;mulateur pour une s&eacute;lection plus ais&eacute;e.</P>

</BLOCKQUOTE>

<H2><A NAME="Acces_direct"></A>12. Acc&egrave;s direct aux disquettes</H2>
<P>Le mode normal de gestion des disquettes de l'&eacute;mulateur Teo est, &agrave; l'instar des autres p&eacute;riph&eacute;riques, la virtualisation: les disquettes sont repr&eacute;sent&eacute;es par des fichiers au format SAP (extension .sap) et toutes les manipulations, en lecture ou en &eacute;criture, sont r&eacute;alis&eacute;es sur ces fichiers. Les deux b&eacute;n&eacute;fices en sont une grande souplesse d'utilisation et une protection des donn&eacute;es originales des disquettes TO8.</P>
<P>N&eacute;anmoins, puisque le format 3"5 standard de disquette est rest&eacute; le m&ecirc;me depuis le premier TO8 jusqu'&agrave; aujourd'hui, il est possible mat&eacute;riellement de faire acc&eacute;der directement tout PC aux disquettes 3"5 du TO8, &agrave; la fois en lecture et en &eacute;criture. Le menu disquettes du <A HREF="#Panneau_de_controle">Panneau de contr&ocirc;le</A> de Teo permet de s&eacute;lectionner cet acc&egrave;s direct pour les lecteurs 3"5 disponibles sur le syst&egrave;me.</P>
<P>Sans commande explicite de l'utilisateur, dans le m&ecirc;me souci de protection des donn&eacute;es originales des disquettes Thomson, seule la <EM>lecture</EM> directe est autoris&eacute;e: la case de protection en &eacute;criture d'un lecteur en acc&egrave;s direct reste bloqu&eacute;e en position active. Il est toutefois possible d'autoriser l'&eacute;criture directe (et donc &eacute;galement le formatage direct de disquettes 3"5 - 720 ko au format Thomson) en lan&ccedil;ant Teo avec l'option <KBD>--enable-direct-write</KBD> (cette option n'est volontairement pas affich&eacute;e par l'aide en ligne). Mais il est <B>tr&egrave;s fortement recommand&eacute;</B> de ne pas utiliser l'&eacute;criture directe sur des disquettes originales Thomson: le format TO n'est pas le format natif des PC et des incompatibilit&eacute;s r&eacute;siduelles pourraient avoir de <B>graves</B> cons&eacute;quences sur l'int&eacute;grit&eacute; des donn&eacute;es; n'utiliser l'&eacute;criture directe que sur des <B>copies</B>, &eacute;ventuellement r&eacute;alis&eacute;es par Teo lui-m&ecirc;me.</P>
<P>A noter que le format de disquettes utilis&eacute; par Thomson est le 3"5 Double Densit&eacute; Double Face (720 ko - 2DD). Mais il est possible de se servir de disquettes 3"5 Haute Densit&eacute; Double Face (1.44 Mo - 2HD) en occultant par un simple morceau de scotch l'encoche de droite de la disquette.</P>

<H3>Activer l'acc&egrave;s direct aux disquettes sur les syst&egrave;mes Linux r&eacute;cents</H3>

<P>Sur les syst&egrave;mes r&eacute;cents, les lecteurs de disquette ne sont pas actifs &agrave; l'installation. Il est n&eacute;cessaire de proc&eacute;der &agrave; quelques ajustements &agrave; partir d'un Terminal :<P>

<P><U>Cr&eacute;er l'entr&eacute;e pour le premier lecteur (si vous en avez un) :</U></P>
<UL>
<LI>Ex&eacute;cuter <CODE>sudo mkdir /media/floppy0</CODE></LI>
<LI>Ex&eacute;cuter <CODE>sudo gedit /etc/fstab</CODE></LI>
<LI>Ajouter la ligne <CODE>/dev/fd0 /media/floppy0 auto rw,user,noauto,exec 0 0</CODE> si aucune ligne ne commence par <KBD>/dev/fd0</KBD></LI>
<LI>Enregistrer le fichier et quitter GEdit</LI>
</UL>

<P><U>Cr&eacute;er l'entr&eacute;e pour le deuxi&egrave;me lecteur (si vous en avez un) :</U></P>
<UL>
<LI>Ex&eacute;cuter <CODE>sudo mkdir /media/floppy1</CODE></LI>
<LI>Ex&eacute;cuter <CODE>sudo gedit /etc/fstab</CODE></LI>
<LI>Ajouter la ligne <CODE>/dev/fd1 /media/floppy1 auto rw,user,noauto,exec 0 0</CODE> si aucune ligne ne commence par <KBD>/dev/fd1</KBD></LI>
<LI>Enregistrer le fichier et quitter GEdit</LI>
</UL>

<P><U>D&eacute;clarer les acc&egrave;s disquette :</U></P>
<UL>
<LI>Ex&eacute;cuter <CODE>sudo gedit /etc/modules</CODE></LI>
<LI>Ajouter la ligne <CODE>floppy</CODE> si elle n'existe pas</LI>
<LI>Enregistrer le fichier et quitter GEdit</LI>
<LI>Ex&eacute;cuter <CODE>sudo adduser $USER floppy</CODE></LI>
</UL>

<P><U>Et pour finir, activer Le tout :</U></P>
<UL>
<LI>Red&eacute;marrer l'ordinateur</LI>
</UL>

<P>Si toutefois la lecture directe a des difficult&eacute;s &agrave; fonctionner (erreurs d'entr&eacute;e/sortie, par exemple), cliquez avec le bouton droit sur <KBD>Lecteur de disquettes</KBD> dans votre navigateur de fichiers et s&eacute;lectionnez <KBD>D&eacute;tecter le m&eacute;dia</KBD>.<P>

<H2><A NAME="Commandes_diverses"></A>13. Commandes diverses</H2>
<UL>
<LI>[F10] affiche le debugger de Teo.</LI>
</UL>

<H2><A NAME="Desinstallation"></A>14. D&eacute;sinstallation</H2>
<P>Si l'installation a &eacute;t&eacute; faite avec les fichiers <KBD>tar.gz</KBD>, il suffit d'&eacute;liminer le r&eacute;pertoire <KBD>teo</KBD> racine.</P>
<P>Si l'installation a &eacute;t&eacute; faite avec les fichiers <KBD>.deb</KBD>, ex&eacute;cuter <CODE>sudo apt-get remove --purge teo</CODE> dans un Terminal. Il se peut que l'entr&eacute;e dans le menu <KBD>Applications/Jeux/Emulateur Teo</KBD> ne disparaisse pas. Ex&eacute;cuter alors <CODE>rm ~/.local/share/applications/teo.desktop</CODE>. Et pour vraiment tout nettoyer, ex&eacute;cuter <CODE>rm -r ~/.teo</CODE>, qui est le r&eacute;pertoire contenant les fichiers <KBD>teo.cfg</KBD> et  <KBD>autosave.img</KBD>.</P>

<H2><A NAME="Limitations_et_bugs"></A>15. Limitations et bugs</H2>
<P>Les contraintes mat&eacute;rielles font qu'en mode graphique 8 bits (256 couleurs) Teo n'&eacute;mule qu'imparfaitement les changements dynamiques de palette de couleurs.</P>
<P>Merci d'utiliser le <A HREF="mailto:ebotcazou_at_libertysurf_dot_fr">mail</A> pour toute remarque, suggestion et pour signaler les in&eacute;vitables bugs.</P>

<H2><A NAME="Remerciements"></A>16. Remerciements</H2>
<UL>
<LI><A HREF="http://www.sylvain-huet.com">Sylvain Huet</A> qui a b&acirc;ti le coeur de l'&eacute;mulateur,</LI>
<LI><A HREF="http://www.gtk.org">The GTK+ Team</A> pour leur toolkit souple et performant,</LI>
<LI>et tous ceux qui m'ont signal&eacute; un probl&egrave;me ou sugg&eacute;r&eacute; une am&eacute;lioration &agrave; apporter &agrave; Teo.</LI>
</UL>

<HR>
<TABLE WIDTH="100%" SUMMARY="pied de page">
<TR>
<TD ALIGN="LEFT"><SMALL>Copyright &copy; 1999-2012 Eric Botcazou <A HREF="mailto:ebotcazou_at_libertysurf_dot_fr">(ebotcazou at libertysurf dot fr)</A><BR>
Venez discuter de Teo sur le <A HREF="http://www.logicielsmoto.com/forumframe.php">Forum LogicielsMoto</A><BR>
Derni&egrave;re modification: mercredi 27 juillet 2011</SMALL></TD>
<TD ALIGN="RIGHT">
<TABLE SUMMARY="Teo Home Page">
<TR>
<TD>Teo Home Page</TD>
<TD><A HREF="http://nostalgies.thomsonistes.org/teo_home.html"> <IMG SRC="images/home.gif" WIDTH="32" HEIGHT="32" ALT="Teo Home Page"></A></TD>
</TR>
</TABLE>
</TD></TR></TABLE>
</TD></TR></TABLE>
</BODY>
</HTML>

