<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-1.8.1-1">
<TITLE>Teo - Manuel d'utilisation</TITLE>
<link REL="stylesheet" TYPE="text/css" HREF="doc.css">

</HEAD>
<BODY>
<TABLE WIDTH="100%"><TR><TD CLASS="ttitre">
<IMG SRC="images/logo.jpg" WIDTH="324" HEIGHT="64" ALT="logo Teo">
</TD></TR></TABLE>

<CENTER>
L'&eacute;mulateur Thomson TO8<BR>
version 1.8.1 (Windows/DirectX)<BR>
Copyright &copy; 1997-2012 Gilles F&eacute;tis, Eric Botcazou, Alexandre Pukall, J&eacute;r&eacute;mie Guillaume, Fran&ccedil;ois Mouret, Samuel Devulder<BR><BR>
</CENTER>

<TABLE WIDTH="100%"><TR><TD CLASS="ttexte">
<A HREF="#Introduction">1. Introduction</A><BR>
<A HREF="#Installation">2. Installation</A><BR>
<A HREF="#Lancement">3. Lancement</A><BR>
<A HREF="#Modes_graphiques">4. Modes graphiques</A><BR>
<A HREF="#Clavier">5. Clavier</A><BR>
<A HREF="#Manettes">6. Manettes</A><BR>
<A HREF="#Souris">7. Souris</A><BR>
<A HREF="#Crayon_optique">8. Crayon optique</A><BR>
<A HREF="#Generateur_sonore">9. G&eacute;n&eacute;rateur sonore</A><BR>
<A HREF="#Supports_amovibles">10. Supports amovibles de lecture/&eacute;criture</A><BR>
<A HREF="#Imprimante_matricielle">11. Imprimante matricielle</A><BR>
<A HREF="#Panneau_de_controle">12. Panneau de contr&ocirc;le</A><BR>
<A HREF="#Acces_direct">13. Acc&egrave;s direct aux disquettes</A><BR>
<A HREF="#Commandes_diverses">14. Commandes diverses</A><BR>
<A HREF="#Limitations_et_bugs">15. Limitations et bugs</A><BR>
<A HREF="#Remerciements">16. Remerciements</A><BR>
<BR>

<H2><A NAME="Introduction"></A>1. Introduction</H2>
<P>Teo est un &eacute;mulateur TO8 pour PC, i.e il reproduit <EM>aussi fid&egrave;lement que possible</EM> sur PC le fonctionnement d'un autre micro-ordinateur: le Thomson TO8.</P>
<P>Teo ne r&eacute;alise lui-m&ecirc;me que l'&eacute;mulation <EM>mat&eacute;rielle</EM> du TO8, &agrave; savoir celle du microprocesseur Motorola MC6809E, de la carte m&eacute;moire, de la carte vid&eacute;o et des p&eacute;riph&eacute;riques suivants: souris, crayon optique, manettes de jeux, lecteur de cassettes, lecteurs de disquettes et imprimante matricielle.</P>

<H2><A NAME="Installation"></A>2. Installation</H2>
<P>Pour faire fonctionner l'&eacute;mulateur, vous devez disposer au minimum d'un 80486 muni de 8 Mo de RAM, tournant sous Windows 95, Windows 98, Windows Millenium edition, Windows NT4, Windows 2000 ou Windows XP; les composants redistribuables DirectX version 3.0 ou sup&eacute;rieure doivent &ecirc;tre install&eacute;s. Une carte son compatible DirectSound est n&eacute;cessaire pour l'&eacute;mulation sonore.</P>

<P>Vous pouvez installer l'&eacute;mulateur de deux fa&ccedil;ons:</P>
<UL>
<LI>Ex&eacute;cutez <KBD>teow-1.8.1-setup.exe</KBD>.
<LI>D&eacute;sarchivez <KBD>teo-1.8.1-winexe.zip</KBD>. Le programme &eacute;x&eacute;cutable se nomme <KBD>teow.exe</KBD>.</LI>
</UL>

<H2><A NAME="Lancement"></A>3. Lancement</H2>
<P>Le lancement du programme &eacute;x&eacute;cutable provoque l'affichage d'une fen&ecirc;tre de s&eacute;lection du mode graphique s'il n'a pas d&eacute;j&agrave; &eacute;t&eacute; sp&eacute;cifi&eacute; sur la ligne de commande, puis le d&eacute;marrage de l'&eacute;mulation.</P>
<CENTER><IMG SRC="images/teo_w0fr.gif" WIDTH="402" HEIGHT="353" ALT="Fen&ecirc;tre de d&eacute;marrage"></CENTER>
<BR>
<P>Teo accepte les param&egrave;tres suivants sur la ligne de commande:</P>
<TABLE BORDER="0" SUMMARY="options">
<TR><TD><KBD>[-m file.m7]</KBD></TD><TD>place la cartouche file.m7 dans le lecteur</TD></TR>
<TR><TD><KBD>[-fast]</KBD></TD><TD>active la pleine vitesse de l'&eacute;mulateur</TD></TR>
<TR><TD><KBD>[-nosound]</KBD></TD><TD>supprime le son de l'&eacute;mulateur</TD></TR>
<TR><TD><KBD>[-nojoy]</KBD></TD><TD>d&eacute;sactive la prise en charge des joysticks PC</TD></TR>
<TR><TD><KBD>[-mode40]</KBD></TD><TD>lance l'&eacute;mulateur en mode plein &eacute;cran 40 colonnes 16 couleurs</TD></TR>
<TR><TD><KBD>[-mode80]</KBD></TD><TD>lance l'&eacute;mulateur en mode plein &eacute;cran 80 colonnes 16 couleurs</TD></TR>
<TR><TD><KBD>[-truecolor]</KBD></TD><TD>lance l'&eacute;mulateur en mode plein &eacute;cran 80 colonnes 4096 couleurs</TD></TR>
<TR><TD><KBD>[-window]</KBD></TD><TD>lance l'&eacute;mulateur en mode fen&ecirc;tr&eacute; 80 colonnes 4096 couleurs</TD></TR>
<TR><TD><KBD>[-loadstate]</KBD></TD><TD>charge le dernier &eacute;tat sauvegard&eacute; de l'&eacute;mulateur</TD></TR>
<TR><TD><KBD>[-interlaced]</KBD></TD><TD>active le mode d'affichage entrelac&eacute;</TD></TR>
<TR><TD><KBD>[xxxxx]</KBD></TD><TD>charge un (des) fichier(s) SAP, K7, M7</TD></TR>
</TABLE>
<P>A noter que le chargement du dernier &eacute;tat sauvegard&eacute; de l'&eacute;mulateur peut aussi &ecirc;tre obtenu en maintenant la touche CTRL (gauche ou droite) appuy&eacute;e au moment de la s&eacute;lection du mode graphique.</P>

<H2><A NAME="Modes_graphiques"></A>4. Modes graphiques</H2>
<P>Teo peut fonctionner dans quatre modes graphiques diff&eacute;rents:</P>
<UL>
<LI>le mode 40 colonnes 16 couleurs (option -mode40) utilise le mode graphique DirectX plein &eacute;cran 320x200x8 disponible sur la plupart des cartes graphiques PC; l'affichage est rapide, adapt&eacute; aux jeux et &agrave; la plupart des applications,</LI>
<LI>le mode 80 colonnes 16 couleurs (option -mode80) utilise le mode graphique DirectX plein &eacute;cran 640x400x8; ce mode est plus lent que le pr&eacute;c&eacute;dent mais n&eacute;cessaire pour les applications fonctionnant en 80 colonnes,</LI>
<LI>le mode 80 colonnes 4096 couleurs (option -truecolor) utilise le mode graphique DirectX plein &eacute;cran 640x400x16; l'affichage est assez lent mais il permet de reproduire fid&egrave;lement les changements dynamiques de palette de couleurs, ce que les modes pr&eacute;c&eacute;dents ne font qu'imparfaitement,</LI>
<LI>le mode 80 colonnes 4096 couleurs (option -window) utilise un mode graphique DirectX fen&ecirc;tr&eacute; 640x400; attention, il peut ne pas &ecirc;tre disponible sur les cartes graphiques un peu anciennes et ne fonctionne pas si Windows tourne en 256 couleurs.</LI>
</UL>
<P>Tous les modes graphiques du TO8 sont correctement &eacute;mul&eacute;s, sauf le 80 colonnes avec l'option -mode40.</P>
<P>Si aucune des quatre options n'est sp&eacute;cifi&eacute;e sur la ligne de commande, un menu est propos&eacute; pour s&eacute;lectionner le mode graphique.</P>

<H2><A NAME="Clavier"></A>5. Clavier</H2>
<P>Le clavier du TO8 est &eacute;mul&eacute; dans sa totalit&eacute;, y compris les combinaisons de touches &agrave; base de CNT et de ACC.</P>
<P>L'&eacute;mulation est fid&egrave;le au clavier du PC (AZERTY), c'est &agrave; dire que le caract&egrave;re affich&eacute; sur l'&eacute;cran est celui inscrit sur la touche PC frapp&eacute;e, pourvu qu'il existe sur le clavier du TO8. Les deux SHIFT et ALTGR jouent leur r&ocirc;le naturel.</P>
<P>La touche STOP est mapp&eacute;e sur le TAB du PC, CNT est mapp&eacute;e sur le CTRL gauche du PC, CAPSLOCK sur CAPSLOCK (le voyant CAPSLOCK est &eacute;mul&eacute;), ACC sur le ALT, HOME sur HOME, les 4 fl&egrave;ches sur les 4 fl&egrave;ches, INS sur INSER, EFF sur SUPPR. A noter que le DEL (=SHIFT+EFF) est mapp&eacute; directement sur BACKSPACE.</P>
<P>Les dix touches de fonctions sont mapp&eacute;es sur F1-F10 (on peut aussi obtenir, par exemple, F6 par Shift+F1).</P>
<P>La touche VERR. NUM. (NUMLOCK) permet d'activer le mode d'&eacute;mulation des manettes par le clavier (voyant NUMLOCK &eacute;teint) d&eacute;taill&eacute; dans la section suivante.</P>

<H2><A NAME="Manettes"></A>6. Manettes</H2>
<P>Teo utilise les joysticks PC disponibles pour &eacute;muler les 2 manettes du TO8. Dans le cas o&ugrave; le nombre de joysticks d&eacute;tect&eacute;s est inf&eacute;rieur &agrave; 2, le(s) joystick(s) manquant(s) est (sont) &eacute;mul&eacute;(s) par le clavier.</P>
<P>Lorsque le mode manettes est activ&eacute; (voyant NUMLOCK &eacute;teint), la pav&eacute; num&eacute;rique PC n'est plus mapp&eacute; sur la pav&eacute; num&eacute;rique du TO8, mais &eacute;mule les huit directions de la premi&egrave;re manette (0 ou 1) non &eacute;mul&eacute;e par un joystick PC. Le bouton Fire est mapp&eacute; sur le CTRL droite.</P>
<P>Dans le m&ecirc;me temps, et si aucun joystick PC n'est d&eacute;tect&eacute;, le bloc gauche clavier (A-E, Q-D, W-C) &eacute;mule la manette 1, tout en continuant &agrave; renvoyer les lettres au TO8 (de cette fa&ccedil;on, il est possible d'utiliser la manette 0 et le clavier complet du TO8). Le bouton Fire est mapp&eacute; sur le CTRL gauche.</P>
<P>Comme sur une manette r&eacute;elle, seule une direction est prise en compte et c'est celle de la derni&egrave;re touche appuy&eacute;e.</P>

<H2><A NAME="Souris"></A>7. Souris</H2>
<P>Sur le TO8 r&eacute;el, la souris est branch&eacute;e sur le port de la manette 0 donc les deux p&eacute;riph&eacute;riques ne peuvent &ecirc;tre utilis&eacute;s simultan&eacute;ment.</P>
<P>Sur le TO8 virtuel, au contraire, les deux fonctionnent en m&ecirc;me temps et la souris est le p&eacute;riph&eacute;rique de pointage par d&eacute;faut au d&eacute;marrage.</P>
<P>Elle a deux boutons mapp&eacute;s sur les boutons gauche et droite de la souris PC.</P>

<H2><A NAME="Crayon_optique"></A>8. Crayon optique</H2>

<P>Pourquoi &eacute;muler sp&eacute;cifiquement le crayon optique alors que la souris joue exactement le m&ecirc;me r&ocirc;le, y compris sous Basic 1.0 ? Il y a deux raisons:</P>
<UL>
<LI>le crayon optique, dans la mythologie thomsoniste, est une ic&ocirc;ne intouchable, &eacute;rig&eacute;e en symbole posthume par les nostalgiques de l'&egrave;re des TO7, TO8 et autres divinit&eacute;s informatiques nationales.</LI>
<LI>plus prosa&iuml;quement, contrairement aux programmes &eacute;crits pour le TO8 et la souris, ceux &eacute;crits pour le TO7, TO7-70 et le crayon optique n'affichent en g&eacute;n&eacute;ral pas de curseur indiquant la position du crayon sur l'&eacute;cran puisque celui-ci est sens&eacute; &ecirc;tre dans la main de l'utilisateur. Avec comme cons&eacute;quence d'&ecirc;tre impossibles &agrave; utiliser sur le TO8 virtuel avec la souris.</LI>
</UL>
<P>Le crayon optique peut donc &ecirc;tre s&eacute;lectionn&eacute; dans le menu R&eacute;glage et Pr&eacute;f&eacute;rences du TO8. Il est encore &eacute;mul&eacute; par la souris PC, son bouton &eacute;tant mapp&eacute; sur le bouton gauche de la souris. Le bouton droit permet alors de faire appara&icirc;tre/dispara&icirc;tre un curseur de rep&eacute;rage.</P>

<H2><A NAME="Generateur_sonore"></A>9. G&eacute;n&eacute;rateur sonore</H2>
<P>Le son du TO8 est &eacute;mul&eacute; via la carte son du PC. Les deux g&eacute;n&eacute;rateurs sonores 1-bit compatible TO7 et 6-bit compatible interface Musique et Jeux sont &eacute;mul&eacute;s.</P>
<P>Teo utilise le p&eacute;riph&eacute;rique sonore par d&eacute;faut du syst&egrave;me (via DirectSound).</P>
<P>Le <A HREF="#Panneau_de_controle">panneau de contr&ocirc;le</A> permet de r&eacute;gler le volume du g&eacute;n&eacute;rateur sonore.</P>

<H2><A NAME="Supports_amovibles"></A>10. Supports amovibles de lecture/&eacute;criture</H2>
<P>Teo peut manipuler trois types de support amovible de lecture et/ou &eacute;criture: les cartouches ROM, les cassettes analogiques et les disquettes 3"5 Thomson. Chaque support est virtualis&eacute; par le biais de fichiers au format M&eacute;mo7 (extension .m7), K7 (extension .k7) et SAP (extension .sap) respectivement.</P>
<P>Voir le <A HREF="#Panneau_de_controle">panneau de contr&ocirc;le</A> pour le mode d'emploi relatif &agrave; leur manipulation avec l'&eacute;mulateur.</P>

<H2><A NAME="Imprimante_matricielle"></A>11. Imprimante matricielle</H2>
<P>Teo contient un module d'&eacute;mulation de l'imprimante matricielle Thomson PR 90-612 qui sait g&eacute;rer &agrave; la fois le mode texte et le mode graphique d'impression.</P>
<P>Dans cette version, le support du mode texte est limit&eacute; au texte brut, qui est restitu&eacute; sous forme de fichiers texte ASCII nomm&eacute;s <KBD>sheetxxx.txt</KBD>.</P>
<P>De m&ecirc;me, le support du mode graphique est limit&eacute; au mode SCREENPRINT 320x200, qui est restitu&eacute; sous forme d'images noir et blanc au format BMP nomm&eacute;es <KBD>pictxxx.bmp</KBD>.</P>
<P>Voir le <A HREF="#Panneau_de_controle">panneau de contr&ocirc;le</A> pour la description de l'interface de contr&ocirc;le de l'imprimante.</P>

<H2><A NAME="Panneau_de_controle"></A>12. Panneau de contr&ocirc;le</H2>
<P>L'appui sur la touche [ESC] du clavier du PC suspend l'&eacute;mulation et ouvre le Panneau de contr&ocirc;le.</P>
<P>L'aspect de l'interface utilisateur d&eacute;pend du mode graphique s&eacute;lectionn&eacute;: dans les modes plein &eacute;cran, elle est affich&eacute;e en surimpression; en mode fen&ecirc;tr&eacute;, elle occupe une fen&ecirc;tre s&eacute;par&eacute;e.</P>
<TABLE WIDTH="100%" SUMMARY="Panneau de contr&ocirc;le">
<TR ALIGN="Center">
<TD><B>Modes plein &eacute;cran</B></TD><TD><B>Mode fen&ecirc;tr&eacute;</B></TD></TR>
<TR ALIGN="Center">
<TD><IMG SRC="images/teo_v1fr.gif" WIDTH="320" HEIGHT="200" ALT="Panneau de contr&ocirc;le"></TD>
<TD><IMG SRC="images/teo_w1fr.gif" WIDTH="327" HEIGHT="353" ALT="Panneau de contr&ocirc;le"></TD>
</TR>
</TABLE>
<P>Ce menu permet de communiquer avec l'&eacute;mulateur et d'acc&eacute;der aux p&eacute;riph&eacute;riques du TO8 (lecteur de cartouches, lecteur de cassettes, lecteurs de disquettes et imprimante matricielle en modes plein &eacute;cran).</P>

<BLOCKQUOTE>

<H3>Commandes et R&eacute;glages</H3>
<TABLE WIDTH="100%" SUMMARY="Commandes et R&eacute;glages">
<TR ALIGN="Center">
<TD><B>Modes plein &eacute;cran</B></TD><TD><B>Mode fen&ecirc;tr&eacute;</B></TD></TR>
<TR ALIGN="Center">
<TD><IMG SRC="images/teo_v2fr.gif" WIDTH="320" HEIGHT="200" ALT="Commandes et R&eacute;glages"></TD>
<TD><IMG SRC="images/teo_w2fr.gif" WIDTH="330" HEIGHT="167" ALT="Commandes et R&eacute;glages"></TD>
</TR>
</TABLE>

<P>Les deux premiers boutons sont &agrave; utiliser avec pr&eacute;caution:</P>
<UL>
<LI>R&eacute;initialiser le TO8: il correspond &agrave; l'appui sur le bouton Reset du TO8 (situ&eacute; &agrave; droite sur le c&ocirc;t&eacute;). Comme sur le v&eacute;ritable TO8, il n'est pas toujours suffisant pour sortir d'un plantage.</LI>
<LI>Red&eacute;marrer &agrave; froid le TO8: plus violent, il correspond &agrave; &eacute;teindre puis rallumer le TO8. A priori rien ne lui r&eacute;siste, mais toutes les donn&eacute;es en m&eacute;moire vive sont alors perdues.</LI>
</UL>
<P>L'option vitesse permet de r&eacute;gler la vitesse de l'&eacute;mulation:</P>
<UL>
<LI>Vitesse exacte: &eacute;mulation du MC6809E &agrave; 1Mhz strictement, c'est le choix normal, le seul utilisable pour les jeux et pour l'&eacute;mulation sonore.</LI>
<LI>Vitesse maximale: &eacute;mulation du MC6809E &agrave; la vitesse maximale atteinte par le PC (&agrave; titre d'exemple un P200 &eacute;mule un MC6809E &agrave; 10Mhz). C'est utilisable pour les utilitaires, c'est m&ecirc;me assez agr&eacute;able d'avoir un TO8 rapide, mais le son est alors d&eacute;sactiv&eacute;.</LI>
<LI>le mode vid&eacute;o entrelac&eacute; simule les &eacute;crans cathodiques en affichant uniquement la moitit&eacute; des lignes &agrave; chaque trame (lignes paires puis impaires), r&eacute;duisant ainsi le scintillement lors des changements rapides d'images (voir par exemple les d&eacute;mos TruC de PULS).</LI>
<LI>Enfin il est possible de charger et de sauvegarder des "images" de l'&eacute;tat de l'&eacute;mulateur &agrave; un instant donn&eacute;; ces images sont en quelque sorte des instantan&eacute;s d'un TO8 en fonctionnement et permettent de faire revenir l'&eacute;mulateur &agrave; un &eacute;tat pr&eacute;alablement sauvegard&eacute;. Cependant, comme elles ne contiennent que l'&eacute;tat interne du TO8 &eacute;mul&eacute;, elles ne prennent pas en compte les p&eacute;riph&eacute;riques (lecteurs de disquettes, etc).</LI>
</UL>

<H3>Lecteur de cartouches</H3>

<TABLE WIDTH="100%" SUMMARY="Lecteur de cartouches">
<TR ALIGN="Center"><TD><B>Modes plein &eacute;cran</B></TD><TD><B>Mode fen&ecirc;tr&eacute;</B></TD></TR>
<TR ALIGN="Center">
<TD><IMG SRC="images/teo_v3fr.gif" WIDTH="320" HEIGHT="200" ALT="Lecteur de cartouches"></TD>
<TD><IMG SRC="images/teo_w3fr.gif" WIDTH="327" HEIGHT="165" ALT="Lecteur de cartouches"></TD>
</TR>
</TABLE>

<P>Ce menu permet de s&eacute;lectionner un fichier au format M&eacute;mo7 (extension .m7) et de le charger comme cartouche (bouton "..."). L'intitul&eacute; de la cartouche appara&icirc;t dans la zone de gauche. A noter que Teo effectue alors un red&eacute;marrage &agrave; froid afin que la cartouche soit effectivement prise en compte et apparaisse sur l'&eacute;cran de d&eacute;marrage.</P>
<P>Il est conseill&eacute; de mettre tous les fichiers M&eacute;mo7 dans un m&ecirc;me sous-r&eacute;pertoire <KBD>memo7</KBD> du r&eacute;pertoire de l'&eacute;mulateur pour une s&eacute;lection plus ais&eacute;e.</P>

<H3>Lecteur de cassettes</H3>

<TABLE WIDTH="100%" SUMMARY="Lecteur de cassettes">
<TR ALIGN="Center"><TD><B>Modes plein &eacute;cran</B></TD><TD><B>Mode fen&ecirc;tr&eacute;</B></TD></TR>
<TR ALIGN="Center">
<TD><IMG SRC="images/teo_v4fr.gif" WIDTH="320" HEIGHT="200" ALT="Lecteur de cassettes"></TD>
<TD><IMG SRC="images/teo_w4fr.gif" WIDTH="327" HEIGHT="165" ALT="Lecteur de cassettes"></TD>
</TR>
</TABLE>

<P>Vous pouvez ici non seulement s&eacute;lectionner le fichier au format K7 (extension .k7) qui joue le r&ocirc;le de cassette (bouton "...") mais aussi choisir de prot&eacute;ger son acc&egrave;s en &eacute;criture (case "prot.") ou encore modifier
la position de la bande (champ num&eacute;rique "Compteur" et boutons "+" et "-") ou m&ecirc;me rembobiner la cassette, i.e revenir au d&eacute;but du fichier (bouton "Rembobiner"). Attention, tout changement de protection d'acc&egrave;s en &eacute;criture provoque automatiquement le rembobinage.</P>
<P>L&agrave; encore, il est conseill&eacute; de mettre tous les fichiers K7 dans un m&ecirc;me sous-r&eacute;pertoire <KBD>k7</KBD> du r&eacute;pertoire de l'&eacute;mulateur pour une s&eacute;lection plus ais&eacute;e.</P>

<H3>Lecteurs de disquettes</H3>

<TABLE WIDTH="100%" SUMMARY="Lecteurs de disquettes">
<TR ALIGN="Center"><TD><B>Modes plein &eacute;cran</B></TD><TD><B>Mode fen&ecirc;tr&eacute;</B></TD></TR>
<TR ALIGN="Center">
<TD><IMG SRC="images/teo_v5fr.gif" WIDTH="320" HEIGHT="200" ALT="Lecteurs de disquettes"></TD>
<TD><IMG SRC="images/teo_w5fr.gif" WIDTH="327" HEIGHT="166" ALT="Lecteurs de disquettes"></TD>
</TR>
</TABLE>
<P>Ce menu permet de s&eacute;lectionner les fichiers au format SAP (extension .sap) qui seront utilis&eacute;s comme disquettes en lecture/&eacute;criture par l'&eacute;mulateur (bouton "..."). Ces fichiers sont des images des disquettes physiques Thomson, r&eacute;alis&eacute;es par un utilitaire sp&eacute;cifiques appel&eacute; SAP, et doivent &ecirc;tre stock&eacute;s sur le disque dur du PC, de pr&eacute;f&eacute;rence dans un sous-r&eacute;pertoire <KBD>disks</KBD> du r&eacute;pertoire de l'&eacute;mulateur.</P>
<P>Les lecteurs 0: et 1: correspondent aux deux faces du premier lecteur physique de disquettes d'un v&eacute;ritable TO8; les lecteur 2: et 3: correspondent quant &agrave; eux aux deux faces du second lecteur.</P>
<P>Il est possible d'activer pour chacun des lecteurs, ind&eacute;pendamment des autres, la protection d'acc&egrave;s en &eacute;criture de la disquette (case "prot.").</P>
<P>A noter qu'une led verte s'allume en haut &agrave; droite de l'&eacute;cran lorsqu'un acc&egrave;s disque est en cours.</P>

<H3>Imprimante matricielle (modes plein &eacute;cran uniquement)</H3>

<CENTER><IMG SRC="images/teo_v6fr.gif" WIDTH="320" HEIGHT="200" ALT="Imprimante matricielle"></CENTER>
<P>Ce menu permet de piloter l'imprimante matricielle PR 90-612 branch&eacute;e sur le port Centronics du TO8.</P>
<P>L'option "Sortie graphique" permet d'activer/d&eacute;sactiver l'impression des donn&eacute;es graphiques sous forme d'images en noir et blanc au format BMP.</P>
<P>Les autres composants du menu reproduisent l'interface de contr&ocirc;le native de l'imprimante PR 90-612:</P>

<P>Les voyants:</P>
<UL>
<LI>Le voyant "NLQ/Failure" indique que l'imprimante est en mode texte haute qualit&eacute; lorqu'il est totalement allum&eacute; ou qu'un probl&egrave;me est survenu &agrave; l'imprimante lorsqu'il est partiellement allum&eacute; (non utilis&eacute; dans cette version).</LI>
<LI>Le voyant "On" indique que l'imprimante est allum&eacute;e.</LI>
<LI>Le voyant "On-Line" indique que l'imprimante est en &eacute;tat de recevoir des donn&eacute;es de l'unit&eacute; centrale.</LI>
</UL>

<P>Les boutons de commandes:</P>
<UL>
<LI>Le bouton "On-Line" permet d'activer/d&eacute;sactiver l'&eacute;tat de r&eacute;ception des donn&eacute;es. Il commande directement le voyant "On-Line".</LI>
<LI>Le bouton "Line Feed" permet de terminer la ligne de texte en cours (ou de sauter une ligne si aucune n'est commenc&eacute;e). Il ne fonctionne qu'en mode "Off-Line" (voyant "On-Line" &eacute;teint).</LI>
<LI>Le bouton "Form Feed" permet d'activer/d&eacute;sactiver le mode texte haute qualit&eacute; lorsque l'imprimante est en mode On-Line (voyant "On-Line" allum&eacute;). En mode "Off-Line", il permet de terminer la page de texte en cours.</LI>
</UL>

</BLOCKQUOTE>

<H2><A NAME="Acces_direct"></A>13. Acc&egrave;s direct aux disquettes</H2>
<P>Non disponible pour le moment.</P>

<H2><A NAME="Commandes_diverses"></A>14. Commandes diverses</H2>
<UL>
<LI>[F11] permet de r&eacute;aliser une capture d'&eacute;cran et de la sauvegarder au format BMP dans le r&eacute;pertoire de Teo.</LI>
</UL>

<H2><A NAME="Limitations_et_bugs"></A>15. Limitations et bugs</H2>
<P>Les contraintes mat&eacute;rielles font que les modes graphiques 16 couleurs n'&eacute;mulent qu'imparfaitement les changements dynamiques de palette de couleurs. De m&ecirc;me, le pourtour de l'&eacute;cran n'est pas &eacute;mul&eacute; dans les modes plein &eacute;cran.</P>
<P>Merci d'utiliser le <A HREF="mailto:ebotcazou_at_libertysurf_dot_fr">mail</A> pour toute remarque, suggestion et pour signaler les in&eacute;vitables bugs.</P>

<H2><A NAME="Remerciements"></A>16. Remerciements</H2>
<UL>
<LI><A HREF="http://www.sylvain-huet.com">Sylvain Huet</A> qui a b&acirc;ti le coeur de l'&eacute;mulateur,</LI>
<LI><A HREF="http://alleg.sourceforge.net">Shawn Hargreaves</A> and friends pour leur magnifique librairie Allegro,</LI>
<LI><A HREF="http://www.mingw.org">Mumit Khan</A> and friends pour le tr&egrave;s utile MinGW,</LI>
<LI>et tous ceux qui m'ont signal&eacute; un probl&egrave;me ou sugg&eacute;r&eacute; une am&eacute;lioration &agrave; apporter &agrave; Teo.</LI>
</UL>

<HR>
<TABLE WIDTH="100%" SUMMARY="pied de page">
<TR>
<TD ALIGN="LEFT"><SMALL>Copyright &copy; 1999-2012 Eric Botcazou <A HREF="mailto:ebotcazou_at_libertysurf_dot_fr">(ebotcazou at libertysurf dot fr)</A><BR>
Venez discuter de Teo sur le <A HREF="http://www.logicielsmoto.com/forumframe.php">Forum LogicielsMoto</A><BR>
Derni&egrave;re modification: mercredi 27 juillet 2011</SMALL></TD>
<TD ALIGN="RIGHT">
<TABLE SUMMARY="Teo Home Page">
<TR>
<TD>Teo Home Page</TD>
<TD><A HREF="http://nostalgies.thomsonistes.org/teo_home.html"> <IMG SRC="images/home.gif" WIDTH="32" HEIGHT="32" ALT="Teo Home Page"></A></TD>
</TR>
</TABLE>
</TD></TR></TABLE>
</TD></TR></TABLE>
</BODY>
</HTML>

