<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Teo</title>
<link rel="stylesheet" type="text/css" href="doc.css">
</head>
<body>
<table width="100%"><tr><td>

<p>[<a href="indexfr.htm">Page d'accueil</a>][<a href="teowinen.htm">Page in English</a>]</p>

<h3>Informations suppl&eacute;mentaires sur Teo Windows/DirectX</h3>

<h5>Installation</h5>

<p>Pour faire fonctionner l'&eacute;mulateur, vous devez disposer au minimum d'un 80486 muni de 8 Mo de RAM, tournant sous Windows 95, Windows 98, Windows Millenium edition, Windows NT4, Windows 2000 ou Windows XP; les composants redistribuables DirectX version 3.0 ou sup&eacute;rieure doivent &ecirc;tre install&eacute;s. Une carte son compatible DirectSound est n&eacute;cessaire pour l'&eacute;mulation sonore.</p>

<p>Vous pouvez installer l'&eacute;mulateur de deux fa&ccedil;ons:</p>

<ul>
<li>Ex&eacute;cutez <em><code>teow-1.8.1-setup.exe</code></em>.</li>
<li>D&eacute;sarchivez <em><code>teo-1.8.1-winexe.zip</code></em>. Le programme &eacute;x&eacute;cutable se nomme <em><code>teow.exe</code></em>.</li>
</ul>

<h5>Lancement</h5>

<p>Le lancement du programme &eacute;x&eacute;cutable provoque l'affichage d'une fen&ecirc;tre de s&eacute;lection du mode graphique s'il n'a pas d&eacute;j&agrave; &eacute;t&eacute; sp&eacute;cifi&eacute; sur la ligne de commande, puis le d&eacute;marrage de l'&eacute;mulation.</p>

<p>Teo accepte les param&egrave;tres suivants suppl&eacute;mentaires sur la ligne de commande:</p>

<table border="1" width="100%">
<tr><td>[-nojoy]</td><td>d&eacute;sactive la prise en charge des joysticks PC</td></tr>
<tr><td>[-mode40]</td><td>lance l'&eacute;mulateur en mode plein &eacute;cran 40 colonnes 16 couleurs</td></tr>
<tr><td>[-mode80]</td><td>lance l'&eacute;mulateur en mode plein &eacute;cran 80 colonnes 16 couleurs</td></tr>
<tr><td>[-truecolor]</td><td>lance l'&eacute;mulateur en mode plein &eacute;cran 80 colonnes 4096 couleurs</td></tr>
<tr><td>[-window]</td><td>lance l'&eacute;mulateur en mode fen&ecirc;tr&eacute; 80 colonnes 4096 couleurs</td></tr>
<tr><td>[xxxxx]</td><td>charge un (des) fichier(s) SAP, K7, M7</td></tr>
</table>

<p>A noter que le chargement du dernier &eacute;tat sauvegard&eacute; de l'&eacute;mulateur peut aussi &ecirc;tre obtenu en maintenant la touche CTRL (gauche ou droite) appuy&eacute;e au moment de la s&eacute;lection du mode graphique.</p>

<h5>Joysticks</h5>

<p>Teo utilise les joysticks PC disponibles pour &eacute;muler les 2 joysticks du TO8. Dans le cas o&ugrave; le nombre de joysticks d&eacute;tect&eacute;s est inf&eacute;rieur &agrave; 2, le(s) joystick(s) manquant(s) est (sont) &eacute;mul&eacute;(s) par le clavier.</p>

<h5>G&eacute;n&eacute;rateur sonore</h5>

<p>Teo utilise le p&eacute;riph&eacute;rique sonore par d&eacute;faut du syst&egrave;me (via DirectSound).</p>

<h5>Images</h5>

<p>Il est possible de charger et de sauvegarder des "images" de l'&eacute;tat de l'&eacute;mulateur &agrave; un instant donn&eacute;; ces images sont en quelque sorte des instantan&eacute;s d'un TO8 en fonctionnement et permettent de faire revenir l'&eacute;mulateur &agrave; un &eacute;tat pr&eacute;alablement sauvegard&eacute;. Cependant, comme elles ne contiennent que l'&eacute;tat interne du TO8 &eacute;mul&eacute;, elles ne prennent pas en compte les p&eacute;riph&eacute;riques (lecteurs de disquettes, etc).</p>

<hr />

<p><center><p>Teo developers &copy; 1997-2012</p></center></p>

</td></tr></table>
</body>
</html>
